package main

import "fmt"

func main() {
	var x = 10

	if x != 0 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("Неизвестное число")
	}
	if x == 0 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 0")
	}
	if x == 1 && x != 0 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 1")
	}	
	if x == 2 && x != 1 && x != 0 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 2")
	}
	if x == 3 && x != 1 && x != 2 && x != 0 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 3")
	}
	if x == 4 && x != 1 && x != 2 && x != 3 && x != 0 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 4")
	}
	if x == 5 && x != 1 && x != 2 && x != 3 && x != 4 && x != 0 && x != 6 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 5")
	}
	if x == 6 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 0 && x != 7 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 6")
	}
	if x == 7 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 0 && x != 8 && x != 9 && x != 10 {
		fmt.Println("x = 7")
	}
	if x == 8 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 0 && x != 9 && x != 10 {
		fmt.Println("x = 8")
	}
	if x == 9 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 0 && x != 10 {
		fmt.Println("x = 9")
	}
	if x == 10 && x != 1 && x != 2 && x != 3 && x != 4 && x != 5 && x != 6 && x != 7 && x != 8 && x != 9 && x != 0 {
		fmt.Println("x = 10")
	}
}
